//========================================================================================================================================================
//========================================================================================================================================================

//ДОМАШКА
/*
1. Изучить теорию
2. Решить задачи:
*/
/*
// Задача №1.
// Какое число (длинну) мы получим?
let arr = ['Ваня', 'Иштван', 'Оля',];
let newArr = arr;
newArr.push('Петя');
console.log(arr.length);

// Решение

// Длина массива составит число 4
*/
/*
// Задача №2.

// Создайте массив users с элементами "Ваня" и "Иштван".
// Добавьте "Оля" в конец.
// Замените значение в "Иштван" на "Петя".
// Ваш код для поиска значения должен
// работать для массивов с любой длиной.
// Удалите первый элемент массива и покажите его.
// Вставьте "Маша" и "Паша" в начало массива.

// Решение

// Создаем массив users
let users = ["Ваня", "Иштван"];
console.log(`Выводим весь масив: ${users}`);

// Добавляем "Оля" в конец
let push = users.push("Оля");
console.log(`Выводим весь масив: ${users}`);

// Заменяем "Иштван" на "Петя"
let del = users[1] = "Петя";

console.log(`Удаляем первый элемент масива users: ${del}`);

// Второй способ

// Удаляем первый элемент и показываем его
// let removed = users.shift();
// console.log("Удаленный элемент:", removed);

// Вставляем "Маша" и "Паша" в начало
users.unshift("Маша", "Паша");

// Выводим итоговый массив

console.log(`Итоговый масив: ${users}`);

*/

/*

// Задача №3.
// Удалить элемент 'Иштван' и возвратить его в переменную
let arr = ['Ваня', 'Иштван', 'Оля',];

// Решение

arr.splice(1, 1);
console.log(arr);

*/

/*

// Задача №4.
//Сделать из строки массив
let str = 'Ваня,Иштван,Оля';

// Решение

let srt = str.split(", ");
console.log(srt);
*/


// Задача №5.
// Чему равен previousValue в начале работы метода?

// Сам условный код

// let arr = [9, 2, 8,];
// let reduceValue = arrTwo.reduce(function (previousValue, item, index, array) {
// 	console.log(previousValue);
// });


// Мой код, связаный с выводом previousValue всего масива на экран

// let arr = [9, 2, 8];
// let reduceValue = arr.reduce(function (previousValue, item, index, array) {
//     return item + previousValue;    // Вывод всего масива на экран
// }, 0);
// console.log(reduceValue);

// Решение

// previousValue в начале работы метода равен 9
// А сума всего previousValue будет равна 19

//========================================================================================================================================================
//========================================================================================================================================================
//========================================================================================================================================================