//ДОМАШКА
/*
1. Изучить теорию
2. Решить задачи:
*/
/*
// // Задача №1. Верна ли запись?
// let fls = "фрилансер";
// let text = 'Привет! Я ${fls}';
// // Ожидаем получить Привет! Я фрилансер
// console.log(text);

// Решение

let fls = " фрилансер";
let text = 'Привет! Я' + fls;
// Ожидаем получить Привет! Я фрилансер
console.log(text);



/*

// Задача №2. Получить символ "н" строки:
let text = 'фрилансер';
let symbol = text[text.length - 4];

// Решение

let text = 'фрилансер';
let symbol = text[text.length - 4];
console.log(symbol);

*/

/*

// Задача №3. Верно?
let text = 123 + "456";
// Ожидаем 579
console.log(text);

// Решение

// Решение будет неверно

*/


/*

// Задача №4. Получить строку в верхнем регистре
let text = 'фрилансер';

// Решение

console.log(text.toUpperCase());

*/

/*

// Задача №5. Получить подстроку "лан" из:
let text = 'фрилансер';

// Решение

let result = text.slice(3, 6);
console.log(result); // 👉 "лан"

*/



/*

// Задача №6. true или false ?
let text = 'фрилансер';
console.log(text.includes('лан', 4));

// Решение

// console.log(text.includes('лан', 3)); - Правда выведется

*/

//========================================================================================================================================================
//========================================================================================================================================================